# 5.3: Meer dan 2 tabellen koppelen

Je kunt ook meer dan 3 tabellen koppelen met een JOIN. Je koppelt eerst twee tabellen via de kolom met gelijke waarden.
Daarna voeg je een derde tabel toe met een extra JOIN.

```SQL
SELECT ...
FROM tabel1
JOIN tabel2 ON tabel1.kolom = tabel2.kolom
JOIN tabel3 ON tabel2.kolom = tabel3.kolom;
```

<b>Voorbeeld. Deze query geeft een overzicht met <b>besteldepizzacode</b> (uit tabel <i>besteldePizza</i>), <b>naam</b> (uit tabel <i>pizza</i>) en <b>omschrijving</b> (uit tabel <i>formaat</i>) door de drie tabellen te koppelen via kolommen met gelijke waarden.</p>

<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="50%">
<pre><code class="language-sql">
SELECT besteldePizza.besteldepizzacode, pizza.naam, formaat.omschrijving
FROM besteldePizza
JOIN pizza ON besteldePizza.pizzacode = pizza.pizzacode 
JOIN formaat ON besteldePizza.formaatcode = formaat.formaatcode; 
</code></pre>

</td><td width="50%">

<table border="1" cellpadding="4" cellspacing="0">

  <thead>
    <tr>
      <th>besteldepizzacode</th>
      <th>naam</th>
      <th>omschrijving</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>1</td><td>Marinara</td><td>extra groot (40 cm)</td></tr>
    <tr><td>2</td><td>Hawai</td><td>groot (35 cm)</td></tr>
    <tr><td>3</td><td>Fantasia</td><td>klein (25 cm)</td></tr>
    <tr><td>4</td><td>Salmone</td><td>klein (25 cm)</td></tr>
    <tr><td>…</td><td>…</td><td>…</td></tr>
    <tr><td>5833</td><td>Prosciutto</td><td>medium (30 cm)</td></tr>
  </tbody>
</table>
</td></tr></table>


### Verwerkingsopdracht 5.3.1: Overzicht van naam en bodem van alle bestelde pizza's


<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">

<p>Maak een overzicht van alle bestelde pizza’s met daarbij de <b>naam</b> van de pizza (uit de tabel <i>pizza</i>) en de <b>omschrijving</b> van de bodem (uit de tabel <i>bodem</i>).</p>
<p>Tip: Je hebt een derde tabel nodig, namelijk <i>besteldePizza</i>, om de gegevens aan elkaar te koppelen.</p>


</td><td width="65%">

<table border="1" cellpadding="4" cellspacing="0">
  <thead>
    <tr>
      <th>besteldepizzacode</th>
      <th>pizzanaam</th>
      <th>bodem</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>1</td><td>Marinara</td><td>krokante dunne bodem</td></tr>
    <tr><td>2</td><td>Hawai</td><td>glutenvrije bodem</td></tr>
    <tr><td>3</td><td>Fantasia</td><td>panbodem</td></tr>
    <tr><td>4</td><td>Salmone</td><td>krokante dunne bodem</td></tr>
    <tr><td>…</td><td>…</td><td>…</td></tr>
    <tr><td>5833</td><td>Prosciutto</td><td>krokante dunne bodem</td></tr>
  </tbody>
</table>


</td></tr></table>


<p>Bekijk <a href="https://rweeda.github.io/PythonIA/docs/IA_sql_oplossingen.html#opgave531" target="_blank">hier</a> de voorbeelduitwerking.</p>
<!-- ANTWOORD:
<ol type="alpha">
<li>
<pre><code class="language-sql">
SELECT besteldepizza.bestelcode, pizza.naam AS pizzanaam, bodem.omschrijving AS bodembeschrijving
FROM besteldepizza
JOIN pizza ON besteldepizza.pizzacode = pizza.pizzacode
JOIN bodem ON besteldepizza.bodemcode = bodem.bodemcode;
</code></pre>
</li>
<li>
Je kunt dit niet doen zonder JOIN, omdat de informatie die je nodig hebt verspreid is over meerdere tabellen.<br>
In de tabel <code>besteldepizza</code> staat de <code>pizzacode</code> en de <code>bodemcode</code>,
maar de naam van de pizza staat in de tabel <code>pizza</code>,
en de omschrijving van de bodem staat in de tabel <code>bodem</code>.
</li>
</ol>
-->